
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 178, 11, 64)       256       
_________________________________________________________________
activation (Activation)      (None, 178, 11, 64)       0
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 59, 11, 64)        0
_________________________________________________________________
dropout (Dropout)            (None, 59, 11, 64)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 57, 11, 64)        12352     
_________________________________________________________________
activation_1 (Activation)    (None, 57, 11, 64)        0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 19, 11, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 19, 11, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 17, 11, 64)        12352
_________________________________________________________________
activation_2 (Activation)    (None, 17, 11, 64)        0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 5, 11, 64)         0
_________________________________________________________________
dropout_2 (Dropout)          (None, 5, 11, 64)         0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 11, 64)         12352
_________________________________________________________________
activation_3 (Activation)    (None, 3, 11, 64)         0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 11, 64)         0
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 11, 64)         0
_________________________________________________________________
flatten (Flatten)            (None, 704)               0
_________________________________________________________________
dense (Dense)                (None, 128)               90240
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0
_________________________________________________________________
dropout_4 (Dropout)          (None, 128)               0
_________________________________________________________________
last_dense (Dense)           (None, 9)                 1161
=================================================================
Total params: 128,713
Trainable params: 1,161
Non-trainable params: 127,552